Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པ་བདུན་གྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Discourse The Detailed Account of the Previous Aspirations of the Seven Thus-Gone Ones

source: བམ་པོ་དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་རྒྱུ་བ་རྒྱུ་ཞིང་ཡངས་པ་ཅན་དུ་བྱོན་ཏེ།
en: The Blessed One was wandering through the provinces and came to Vaiśālī.

source: ཡངས་པ་ཅན་ན་རོལ་མོའི་སྒྲ་ཅན་གྱི་ཤིང་ལྗོན་པའི་དྲུང་ན་དགེ་སློང་བརྒྱད་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་དྲུག་སྟོང་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་བརྩེགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་གནོན་པ་དོན་ཡོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བལྟ་ན་སྡུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མུན་པ་མུན་ནག་ཐམས་ཅད་ངེས་པར་འཇོམས་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་ལེགས་པར་རྣམ་པར་སེམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་བརྩེགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སང་སང་པོའི་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་ཆེན་པོའི་རྩེ་འཛིན་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་དྲུག་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: There in Vaiśālī, at the base of the musical tree, he was accompanied by a great saṅgha of eight thousand monks and thirty-six thousand bodhisattvas, including the bodhisattva great being Avalokiteśvara, the bodhisattva great being Mahāmati, the bodhisattva great being Maitreya, the bodhisattva great being Pratibhākūṭa, the bodhisattva great being Amoghavikrāmin, the bodhisattva great being Sudarśana, the bodhisattva great being Sarvata­mondha­kāravidha­mana­mati, the bodhisattva great being Well-Intentioned Thought, the bodhisattva great being Merukūṭa, the bodhisattva great being Gadgadasvara, the bodhisattva great being King Who Holds Great Meru’s Peak, and the bodhisattva great being Vajrapāṇi.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། ཁྱིམ་བདག་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ།
en: He was surrounded and accompanied by all manner of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, kings, ministers, brahmins, kṣatriyas, and householders.

source: ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོའི་ཆོས་སྟོན་ཅིང་ཆོས་ཀྱི་གཏམ་གྱིས་སེམས་ཅན་རྣམས་ཚིམ་པར་མཛད།
en: The Blessed One was giving a Dharma teaching that was virtuous at the beginning, virtuous in the middle, and virtuous at the end, excellent in meaning, and beautiful in expression.

source: ཡང་དག་པར་དགའ་བར་མཛད། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་འགོད་པར་མཛད་དོ།
en: His Dharma talk satisfied beings, made them perfectly happy, and established them in the awakening of a buddha.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་རྒྱལ་བུ་འཇམ་དཔལ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the bodhisattva great being and Dharma prince Mañjuśrī rose from his seat, adjusted his upper robe on one shoulder, knelt with his right knee on the ground, bowed to the Blessed One with his palms together, and made this request to the Blessed One:

source: །བཅོམ་ལྡན་འདས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། ཁྱིམ་བདག་དང་། མི་དང་། མི་མ་ལགས་པ་མང་པོ་དག་ཆོས་ཉན་པའི་སླད་དུ་འདུས་ཤིང་མཆིས་ལགས་ན། དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ།
en: “Blessed One, since many gods, nāgas, yakṣas, rākṣasas, garuḍas, kinnaras, mahoragas, ascetics, brahmins, kings, ministers, householders, human, and nonhuman beings have gathered and are present to hear the Dharma, may the Blessed One have mercy on us.

source: ཐོས་ན་ཅི་ནས་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དང་། སྡིག་པ་ཐམས་ཅད་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་ཞིང་ཡོངས་སུ་བས་པར་འགྱུར་བ་དང་། བདུད་སྡིག་ཅན་གྱིས་མི་བརྫི་བར་འགྱུར་བའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་གནས་རྣམས་བཤད་དུ་གསོལ།
en: Please teach the names of those thus-gone ones who, simply by hearing them, cause all beings to no longer regress on the path to unsurpassed and perfect awakening, who purify and utterly exhaust all their misdeeds and karmic obscurations, and that cause them to no longer be crushed by Māra, the wicked one. Please teach the detailed account of the previous aspirations they made and describe the abodes of their buddhafields with their arrays of good qualities.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ནི་མ་གཟིགས་པ་འམ། མ་གསན་པའམ། རྣམ་པར་མི་མཁྱེན་པ་མི་མངའ་བས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་རྡུལ་ཕྲ་རབ་སྙེད་དག་ཀྱང་དཔེར་ན་དེང་ངམ་སང་གི་ལྟར་དགོངས་པ་ལགས་ཏེ།
en: “Blessed One, since there is nothing that the thus-gone ones do not see, hear, or know, they comprehend as many billions of eons as there are grains of sand in the Gaṅgā river just like the events of today or tomorrow.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་དང་པོ་བྱང་ཆུབ་ཀྱི་ཐུགས་ཡིད་ལ་མཛད་པ་དང་། སྔོན་གྱི་སྨོན་ལམ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་དམིགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་བརྗོད་པ་དང་། ཡང་དག་པར་བསྟན་པར་སྤྱོད་ན། བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དམ་པའི་ཆོས་ལྟར་བཅོས་པ་འབྱུང་བ་ན། སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་གཟུང་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐབས་མཁས་པ་མང་པོ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Since that is the case, and since you explain and correctly teach how these thus-gone ones first generated the mind of awakening, what their previous aspirations were, and what the arrays of good qualities are in the buddhafields related to these thus-gone ones are, Blessed One, in order to support all beings in the future during the final five hundred years when the counterfeit holy Dharma has appeared, will the Blessed One please explain the great skillful means of the thus-gone ones and give a detailed account of their previous aspirations?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་དང་དབྱངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ།
en: With a voice as melodious as the cuckoo’s song, the blessed Thus-Gone One complimented Mañjuśrīkumārabhūta, saying, “Very good, Mañjuśrī, very good.

source: །འཇམ་དཔལ་ཁྱོད་སྙིང་རྗེ་དང་ལྡན་པ་སྟེ།
en: Mañjuśrī, you are a compassionate being.

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་སྙིང་རྗེ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། སེམས་ཅན་ལས་ཀྱི་སྒྲིབ་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲིབས་པ། ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་བ། མྱ་ངན་དང་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱིས་གཙེས་པའི་ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བའི་ཕྱིར་གསོལ་བ་འདེབས་པ་ནི་ཡང་ལེགས་སོ།
en: Mañjuśrī, it is good that the boundless compassion you have generated has led you to make this request to benefit all beings, and so that those gods and humans who are veiled by the various karmic obscurations, whose bodies are tormented by various illnesses, and who are oppressed by various types of mental anguish and suffering might be benefited, helped, and comforted.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས་ཁྱོད་ཀྱི་སྤོབས་པ་འདི་སྐྱེས་སོ།
en: Mañjuśrī, the Thus-Gone One’s blessing has engendered this eloquent request of yours.

source: །འཇམ་དཔལ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: So listen well and keep in mind what I say, Mañjuśrī, and I shall explain.”

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “Yes, Blessed One,” replied Mañjuśrīkumārabhūta.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱིས་མི་ཐུབ་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞམ་རིང་བ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྡན་པ་བཞུགས་ཏེ།
en: “Mañjuśrī,” the Blessed One said, “to the east of this buddhafield, past as many buddhafields as there are grains of sand in the Gaṅgā river, the thus-gone, worthy, and perfect Buddha Supari­kīrtita­nāma­dheyaśrī­rāja lives in the world Unconquered, accompanied by billions of bodhisattva attendants.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་ཡོད་དོ།
en: There he lives, resides, and teaches the Dharma.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ།
en: “Mañjuśrī, the buddhafield of the thus-gone, worthy, and perfect Buddha Supari­kīrtita­nāma­dheyaśrī­rāja is utterly pure.

source: ཐ་གྲུར་དཔག་ཚད་བརྒྱ་སྟོང་དུ་མ་ཡོད་པ།
en: It measures many hundreds of thousands of leagues across.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ།
en: It is flat like the palm of one’s hand.

source: ངན་སོང་དང་། སྡུག་བསྔལ་གྱི་སྒྲ་མེད་པ།
en: There are no lower realms of rebirth or cries of suffering.

source: བུད་མེད་ཀྱི་དངོས་པོ་མེད་པ།
en: There is no such thing as the female gender.

source: ཚེར་མ་དང་གཡང་ས་མེད་པ།
en: There are no thorny plants and no steep cliffs.

source: རི་དང་། རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་མེད་པ།
en: There are no mountains, boulders, rocks, or pebbles.

source: འཇམ་པ། སའི་ངོས་རེག་ན་བདེ་བ།
en: The ground is soft and pleasing to the touch.

source: ལྷའི་དྲི་བསུང་དང་ལྡན་པ། ལྷའི་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དང་། མེ་ཏོག་དང་། འབྲས་བུས་མཛེས་པར་བྱས་པ།
en: It has a divine fragrance, and its divine jeweled trees are decorated with flowers and fruit.

source: རིན་པོ་ཆེའི་སེང་གེའི་ཁྲིས་ལེགས་པར་བརྒྱན་པ།
en: It is adorned with a jeweled lion throne.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་པ་ཕྱིར་མི་ལྡོག་པའི་ས།
en: The bodhisattvas there have attained the stage of nonregression.

source: འཛམ་བུའི་ཆུ་བོའི་གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་གིས་བརྒྱན་པའི་རྫིང་གིས་མཛེས་པར་བྱས་པའོ།
en: It is beautified by pools ornamented with gold from the Jambū river, gems, and pearls.

source: །འཇམ་དཔལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ནི་རྫུས་ཏེ་སྐྱེས་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པདྨ་ལས་བྱུང་བ་ཤ་སྟག་གོ།
en: Mañjuśrī, all the bodhisattvas in that world take a miraculous birth in which they emerge from a lotus made of the seven precious substances.

source: །དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་སྨོན་ལམ་ཐོབ་ཤིག །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་དེ་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ།
en: Thus, a faithful son or daughter of good family should aspire to be born in that buddhafield.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེས་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་རྒྱུན་མ་ཆད་པར་བཏབ་བོ། །བརྒྱད་གང་ཞེ་ན།
en: “Mañjuśrī, from the moment that the thus-gone, worthy, and perfect Buddha Supari­kīrtita­nāma­dheyaśrī­rāja first generated the mind of awakening and while he was practicing bodhisattva conduct, he continually proclaimed the following eight great aspirations:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན་སེམས་ཅན་གང་ལ་ལ་དག་ན་བའི་ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་ཏེ། རིམས་དང་། གཤེད་བྱེད་དང་། བྱད་དང་། རོ་ལངས་དང་། འཇིགས་པ་རྣམས་ཀྱིས་གཙེས་པ་དེ་དག་བདག་གི་མཐུས་བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “His first great aspiration was, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings whose bodies are tormented by various illnesses and who are oppressed by fevers, kṛtyas , kākhordas , vetālas , and other terrors to have all their illnesses pacified when they bear my name in mind and recite my name seven times.

source: བདག་གི་མིང་ལན་བདུན་བརྗོད་པས་དེ་དག་གི་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་རིམས་དང་། སྡིག་པ་ཅན་གྱི་གདོན་རྣམས་མེད་པར་གྱུར་ཅིག །རབ་ཏུ་ཞི་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May they be free from fevers and the demonic influences of wicked beings for as long as it takes them to attain awakening, and may all these things be pacified.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་ལོང་བ་དང་། འོན་པ་དང་། སྨྱོན་པ་དང་། ཤ་བཀྲ་ཅན་དང་། ནད་ཚབས་ཆེན་པོས་བཏབ་པར་གྱུར་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “For his second great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who are blind, deaf, mentally ill, leprous, and affected by acute illness to have fully functional sense faculties for as long as it takes them to attain awakening when they bear my name in mind and recite my name seven times. May all their suffering and illnesses cease.’

source: བདག་གི་མིང་ལན་བདུན་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་དབང་པོ་ཐམས་ཅད་ཡོངས་སུ་ཚང་བར་གྱུར་ཅིག །སྡུག་བསྔལ་དང་ནད་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་བསྒྲིབས་པ། མཚམས་མེད་པ་ལྔ་བྱེད་པ། བྱ་བ་མ་ཡིན་པ་སྤྱོད་པ་མང་བ། དམ་པའི་ཆོས་སྤོང་བ། སྡིག་པ་མི་དགེ་བའི་ལས་སྣ་ཚོགས་བྱེད་པ། ངན་སོང་གསུམ་དང་། སེམས་ཅན་དམྱལ་བར་འགྲོ་བ་དེ་དག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སྐྱེས་ནས་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་དེ་དག་བདག་གི་མཐུས།
en: “For his third great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who are veiled by desire, hatred, and delusion—who commit the five inexpiable acts, abound in improper behavior, forsake the holy Dharma, commit various sinful and nonvirtuous actions, and then proceed to the three lower realms and the hell realms where they are born in the Great Hell and experience intense pain—to purify and exhaust all their obscurations brought on by actions such as the five inexpiable acts and the like when they bear my name in mind and mentally recite my name seven times.

source: བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་གི་མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་ཞིང་ཡོངས་སུ་ཟད་པར་གྱུར་ཅིག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་སུ་ཡང་སེམས་ཅན་དམྱལ་བ་དང་། ངན་འགྲོར་འགྲོ་བར་མ་གྱུར་ཅིག །ལྷ་ཡུལ་བའི་ལྷའི་བདེ་བ་དང་། མིའི་བདེ་བ་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May they not be reborn in the hell realms and in the lower realms for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening. May they experience the divine happiness of the god realms and the happiness of the human realm.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན་སེམས་ཅན་གང་སུ་དག་དབུལ་པོར་གྱུར་ཏེ། ཟས་དང་། སྐོམ་དང་། གོས་དང་། ནོར་དང་། འབྲུ་དང་། མལ་ཆ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། རྒྱན་དང་ཡོ་བྱད་མི་བདོག་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་དབྱིག་དང་། གོས་དང་། ནོར་དང་། འབྲུ་དང་། མལ་ཆ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། རྒྱན་དང་ཡོ་བྱད་འཕེལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his fourth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who are impoverished and who do not have food, drink, clothes, money, grain, bedding, incense, garlands, ornaments, and belongings to have an abundance of riches, clothes, money, grain, bedding, incense, garlands, ornaments, and belongings for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name seven times.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་ལྔ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན་སེམས་ཅན་གང་དག་བཅིང་བ་དང་། བརྡེག་པ་དང་། གོ་རར་གཞུག་པ་དང་། མཚོན་ཆའི་ཚོགས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་བ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བཅིང་བ་དང་། བརྡེག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག །ལུས་ཀྱི་གདུང་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his fifth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power free any beings who are bound, beaten, or tortured, and whose bodies are tormented by various types of weapons from all manner of bondage and beatings for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name seven times.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་དྲུག་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན་སེམས་ཅན་གང་དག་མགོན་མེད་པར་གྱུར་པ། ལུས་ལ་གདུང་བའི་མེ་འབར་བ་དང་། སེང་གེ་དང་། སྟག་དང་། དོམ་དང་། དྲེད་དང་། སྦྲུལ་གདུག་པའི་ནང་དུ་ཆུད་དེ། སྲོག་ལ་བབ་སྟེ་འཇིགས་སྐྲག་ནས་མགོན་མེད་དེ།
en: “For his sixth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who are vulnerable, whose bodies are burned by a blazing fire, who encounter lions, tigers, bears, hyenas, and poisonous snakes, whose lives are endangered, who are rendered defenseless by terror, and who weep and wail, to have any fire that might burn their bodies extinguished.

source: སྨྲེ་སྔགས་སྣ་ཚོགས་འདོན་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ལན་བདུན་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ལུས་ལ་གདུང་བའི་མེ་ཐམས་ཅད་ཞི་བར་གྱུར་ཅིག །སེང་གེ་དང་། སྟག་དང་། དོམ་དང་། དྲེད་དང་། སྦྲུལ་གདུག་པ་དེ་དག་ཀྱང་བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག །འཇིགས་པ་མེད་པ་དང་། ཞི་བའི་གནས་ལ་གནས་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བདུན་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན་སེམས་ཅན་གང་དག་ཕན་ཚུན་འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པར་གྱུར་ཏེ།
en: May it render those lions, tigers, bears, hyenas, and poisonous snakes benevolent, and may it lead those beings to live in peaceful places without fear for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name seven times.’

source: འཁྲུགས་ཤིང་འཇིགས་སྐྲག་ནས་དངངས་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ལན་བདུན་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །ཕན་ཚུན་བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་ཆུའི་ནང་དུ་སོན་ཏེ། གྲུར་ཞུགས་པ་གླིང་མེད་པར་ཕྱིན་པ།
en: “For his seventh great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who fight quarrel, argue, and dispute with one another and who are terrified and anxious, to cease all fighting, quarreling, arguing, and disputing one another and be loving toward one another for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name seven times.’

source: སྲོག་འདོད་པ། ཆུ་ཀླུང་དང་། རྒྱ་མཚོའི་ནང་དུ་སོན་ཏེ། སྨྲེ་སྔགས་སྣ་ཚོགས་འདོན་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ཡིད་ཀྱིས་ལན་བདུན་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ཆུ་ཀླུང་ཆེན་པོ་དེ་ལས་དབུགས་འབྱིན་པ་སྦྱིན་པར་གྱུར་ཅིག །འཇིགས་པ་མེད་པར་རྒལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ།
en: “For his eighth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power comfort any beings who have embarked on a sea voyage, boarded a ship, and traveled out of sight of land, who value their lives, who have ended up in the middle of a great river or an ocean, and who weep and wail as they cross great rivers, and may they have nothing to fear as they complete their journeys for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name seven times.’

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་དེས་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་པོ་དེ་དག་བཏབ་བོ།
en: “Mañjuśrī, those are the eight great aspirations that were proclaimed by the blessed Thus-Gone One Supari­kīrtita­nāma­dheyaśrī­rāja.

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་དེའི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། སྨོན་ལམ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱི་གནས་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་རིམ་གྲོ་མཛད་པ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཞམ་རིང་བ་བྱང་ཆུབ་སེམས་དཔའ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་གནས་པ་རྣམས་མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལོ་བརྒྱར་ཡང་བརྗོད་པར་མི་ནུས་སོ།
en: That is why, Mañjuśrī, even in one hundred years, no one but the thus-gone, worthy, and perfect buddhas and the bodhisattvas dwelling on the ten levels—not even the hearers and solitary buddhas—could describe the aspirations, powerful states of absorption, actions to ripen beings, bodhisattva conduct, worship and service to the thus-gone ones, emanations, purification of buddhafields, and bodhisattva attendants that the blessed Thus-Gone One Supari­kīrtita­nāma­dheyaśrī­rāja has brought forth ever since he first generated the mind of awakening.

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོ་འམ། བློན་པོའམ། ཁྱིམ་བདག་ཡོན་ཏན་དོན་དུ་གཉེར་བ་རྣམས་ཀྱིས་ཞེ་སྡང་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བར་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་གཟུང་བར་བྱ་བཀླག་པར་བྱ་སྟེ།
en: “Mañjuśrī, that is why faithful sons and daughters of good family, kings, ministers, and householders who pursue good qualities should bear the name of that thus-gone one in mind and recite it in order to be free from all manner of hatred and afflictions.

source: རབ་ཏུ་གུས་པར་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱས་ན། དེའི་སྡིག་པ་ཐམས་ཅད་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར།
en: If they are devout and make offerings to that thus-gone one, all their misdeeds, all their karmic obscurations, and all their illnesses will be completely pacified.

source: རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: All their hopes will be fulfilled, and they will not regress on the path to the awakening of a buddha.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ལུང་བདུན་གྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེ་དང་། ཟླ་བ་དང་། པདྨ་ས་རབ་ཏུ་བརྒྱན་པ་མཁས་པ་གཟི་བརྗིད་ཀྱི་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in seven Gaṅgā rivers, the thus-gone, worthy, and perfect Buddha Kuśala­tejonir­ghoṣa­rāja, who is adorned with a precious jewel, a moon, and a lotus, lives in the world Abounding in Jewels.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་སྟོན་པ་ཡོད་དོ།
en: There he lives, resides, and teaches the Dharma, teaching only the instructions of the Great Vehicle to bodhisattvas.
